function [gbest,gBestProfit,history] = ...
    binary_pso( ...
    nVar, ...
    nParticle, ...
    maxIter, ...
    wMax, ...
    wMin, ...
    c1, ...
    c2)

%% =========================================================
% Binary Particle Swarm Optimization
% 二进制粒子群算法
%
% nParticle
%   粒子数
%
% wMax,wMin
%   惯性权重
%
% c1
%   个体学习因子
%
% c2
%   群体学习因子
%% =========================================================


%% =========================================================
% 1. 初始化粒子
%% =========================================================

X = ...
    randi( ...
    [0 1], ...
    nParticle, ...
    nVar);


V = ...
    2*rand(nParticle,nVar)-1;


profit = ...
    zeros(nParticle,1);


for i = 1:nParticle

    profit(i) = ...
        problem3_profit(X(i,:));

end


%% =========================================================
% 2. 个体历史最优
%% =========================================================

pbest = X;

pBestProfit = ...
    profit;


%% =========================================================
% 3. 全局最优
%% =========================================================

[gBestProfit,index] = ...
    max(pBestProfit);


gbest = ...
    pbest(index,:);


history = ...
    zeros(maxIter,1);


%% =========================================================
% 4. 迭代
%% =========================================================

for iter = 1:maxIter


    %% 惯性权重线性下降

    if maxIter == 1

        w = wMin;

    else

        w = ...
            wMax ...
            - (wMax-wMin) ...
            * (iter-1) ...
            / (maxIter-1);

    end


    %% =====================================================
    % 更新每一个粒子
    %% =====================================================

    for i = 1:nParticle


        r1 = rand(1,nVar);

        r2 = rand(1,nVar);


        %% -----------------------------------------
        % 更新速度
        %% -----------------------------------------

        V(i,:) = ...
            w*V(i,:) ...
            + c1*r1.*(pbest(i,:)-X(i,:)) ...
            + c2*r2.*(gbest-X(i,:));


        %% 防止速度过大

        V(i,:) = ...
            min(max(V(i,:),-6),6);


        %% -----------------------------------------
        % Sigmoid转换
        %% -----------------------------------------

        S = ...
            1 ./ ...
            (1+exp(-V(i,:)));


        %% -----------------------------------------
        % 根据概率更新二进制位置
        %% -----------------------------------------

        X(i,:) = ...
            double( ...
            rand(1,nVar) < S ...
            );


        %% 新位置利润

        newProfit = ...
            problem3_profit(X(i,:));


        %% -----------------------------------------
        % 更新个体最优
        %% -----------------------------------------

        if newProfit > pBestProfit(i)

            pBestProfit(i) = ...
                newProfit;

            pbest(i,:) = ...
                X(i,:);

        end

    end


    %% =====================================================
    % 更新全局最优
    %% =====================================================

    [tempProfit,index] = ...
        max(pBestProfit);


    if tempProfit > gBestProfit

        gBestProfit = ...
            tempProfit;

        gbest = ...
            pbest(index,:);

    end


    history(iter) = ...
        gBestProfit;

end

end